<a href="https://colab.research.google.com/github/maheshkajjari/pandascasestudy/blob/master/pandas1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Part 2

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving sales-jan-2015.csv to sales-jan-2015.csv

In [ ]:
import pandas as pd
import io
df1= pd.read_csv(io.StringIO(uploaded['sales-jan-2015.csv'].decode('utf-8')))

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving sales-feb-2015.csv to sales-feb-2015.csv

In [ ]:
import pandas as pd
import io
df2= pd.read_csv(io.StringIO(uploaded['sales-feb-2015.csv'].decode('utf-8')))

In [ ]:
df1.head()

    Product  Units
0  Hardware     11
1   Service      8
2  Hardware     17
3  Hardware     16
4  Hardware     11

In [ ]:
df2.head()

    Product  Units
0   Service      4
1  Software     10
2  Software     13
3  Software      3
4   Service     10

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')
%matplotlib inline

In [ ]:
df1.describe()

           Units
count  20.000000
mean   12.400000
std     4.935372
min     1.000000
25%     8.000000
50%    13.000000
75%    16.250000
max    19.000000

In [ ]:
df1.mean()

Units    12.4
dtype: float64

In [ ]:
df2.describe()

          Units
count  20.00000
mean    8.80000
std     5.63448
min     1.00000
25%     3.75000
50%     9.50000
75%    13.00000
max    19.00000

In [ ]:
df2.mean()

Units    8.8
dtype: float64

In [ ]:
percentage_feb = df2['Units'] / df1['Units'].sum() * 100

In [ ]:
percentage_feb

0     1.612903
1     4.032258
2     5.241935
3     1.209677
4     4.032258
5     7.661290
6     7.661290
7     2.822581
8     5.645161
9     2.822581
10    0.403226
11    1.612903
12    0.403226
13    4.032258
14    5.241935
15    4.032258
16    6.451613
17    3.629032
18    1.209677
19    1.209677
Name: Units, dtype: float64

In [ ]:
Adding_sales = df1['Units'] + df2['Units']

In [ ]:
Adding_sales

0     15
1     18
2     30
3     19
4     21
5     37
6     20
7     13
8     21
9     26
10    18
11    17
12    13
13    24
14    29
15    26
16    23
17    27
18    16
19    11
Name: Units, dtype: int64

#part 1

Pandas

    Chapter 1. Preparing data

1.1 Reading multiple datafiles

1.2 Reindexing Dataframes

1.3 Arithmetic with Series & DataFrames

In [ ]:
# importing the libraires
import pandas as pd

read the dataframe

The primary tool we can use for data import is read_csv. This function accepts the file path of a comma-separated values(CSV) file as input and returns a pandaâ€™s data frame directly.

In [ ]:
# read the (sales-jan-2015) dataset.

### START CODE HERE : 

 import pandas as pd
import io
df1= pd.read_csv(io.StringIO(uploaded['sales-jan-2015.csv'].decode('utf-8')))

### END CODE

In [ ]:
df1

     Product  Units
0   Hardware     11
1    Service      8
2   Hardware     17
3   Hardware     16
4   Hardware     11
5   Software     18
6   Software      1
7    Service      6
8    Service      7
9    Service     19
10  Hardware     17
11   Service     13
12  Hardware     12
13  Software     14
14   Service     16
15  Software     16
16  Hardware      7
17   Service     18
18  Software     13
19   Service      8

In [ ]:
df2

     Product  Units
0    Service      4
1   Software     10
2   Software     13
3   Software      3
4    Service     10
5   Software     19
6    Service     19
7   Software      7
8   Hardware     14
9   Software      7
10  Hardware      1
11  Software      4
12   Service      1
13   Service     10
14  Software     13
15   Service     10
16  Hardware     16
17  Hardware      9
18  Software      3
19  Hardware      3

#sort the table(data) with columns

Reindexing dataframe

~ Sorting dataframe with index and columns.

~ Reindexing dataframe from a list.

In [ ]:
# Create a dataframe
data = {'county': ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df3 = pd.DataFrame(data)

In [ ]:
df3

       county  year  reports
0     Cochice  2012        4
1        Pima  2012       24
2  Santa Cruz  2013       31
3    Maricopa  2014        2
4        Yuma  2014        3

In [ ]:
sorted_data = df3.sort_values(by = ['reports'])

In [ ]:
sorted_data

       county  year  reports
3    Maricopa  2014        2
4        Yuma  2014        3
0     Cochice  2012        4
1        Pima  2012       24
2  Santa Cruz  2013       31

In [ ]:
# sorting table with index

### START CODE HERE : 
sorted_data.sort_index(axis = 1)
### END CODE

sorted_data

       county  year  reports
3    Maricopa  2014        2
4        Yuma  2014        3
0     Cochice  2012        4
1        Pima  2012       24
2  Santa Cruz  2013       31

In [ ]:
# Change the order (the index) of the rows

### START CODE HERE : 
sorted_data.sort_index(axis = 0)
### END CODE

       county  year  reports
0     Cochice  2012        4
1        Pima  2012       24
2  Santa Cruz  2013       31
3    Maricopa  2014        2
4        Yuma  2014        3